Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_post_primary_school/organisations_and_resources_for_post_primary_schools.html.txt.tmx
Source language: en
Languages: ga

source: Organisations and resources for post-primary schools
ga: Eagraíochtaí agus acmhainní le haghaidh iarbhunscoileanna

source: The following websites and list of organisations have been compiled to help parents and teachers
ga: Cuireadh na láithreáin ghréasáin agus liosta eagraíochtaí seo a leanas i dtoll a chéile le cabhrú le tuismitheoirí agus le múinteoirí

source: You may find them particularly helpful if your child is starting post-primary education in Ireland for the first time
ga: B’fhéidir go gcabhródh siad go mór leat má tá do leanbh ag tosú ar iar-bhunoideachas a fháil in Éirinn don chéad uair

source: You may also find these resources useful if you will be moving to Ireland soon and are looking for information on the post-primary or second-level education system here
ga: D’fheadfadh na hacmhainní seo a bheith úsáideadh má tá tú le bogadh go hÉirinn go luath agus má tá eolas faoin gcóras iarbhunoideachais nó oideachais dara leibhéil in Éirinn uait

source: The official education portal provided by the Department of Education and Skills is called Scoilnet
ga: Is í Scoilnet an tairseach oifigiúil oideachais agus is í an Roinn Oideachais agus Scileanna a chuireann ar fáil í

source: It aims to support Ireland’s education community by providing information and advice to students, teachers and parents
ga: Tá sé d’aidhm aici tacaíocht a thabhairt do phobal oideachais na hÉireann trí fhaisnéis agus chomhairle a chur ar fáil do dhaltaí, múinteoirí agus tuismitheoirí

source: Scoilnet offers resources on a wide range of subjects that have been evaluated by subject matter experts to make sure they are relevant to the curricula
ga: Cuireann Scoilnet acmhainní ar fáil faoi réimse leathan ábhar a ndearna saineolaithe na n-ábhar éagsúla measúnú orthu le deimhin a dhéanamh go bhfuil siad ábhartha leis na curaclaim a chuirtear ar fáil in Éirinn

source: These are resources such as lesson plans, interactive and printable worksheets, notes and multimedia content
ga: Tá acmhainní ann mar pleananna ceachtanna, bileoga oibre idirghníomhacha inphriontáilte, nótaí agus ábhar ilmheán

source: Teachers and parents can also get information on current news and events relating to education and parenting
ga: Tá cuntais faoi mhúinteoirí agus faoi scoileanna le fáil sa chuid sin de Scoilnet, ‘Scoileanna ar Líne’ (Schools Online)

source: Scoilnet has a 'Schools Online' section, which is devoted to profiling schools and teachers
ga: Tá eolas ann freisin faoi láithreáin ghréasáin a cheapadh le haghaidh scoileanna

source: It also includes information on building school websites
ga: Tugann Scoilnet bunachar sonraí inchuardaithe de

source: Scoilnet provides a searchable database of primary and post-primary schools, many of which have established their own web pages on this site
ga: bhunscoileanna agus iarbhunscoileanna agus tá go leor de na scoileanna seo tar éis a leathanaigh ghréasáin féin a cheapadh ar an láithreán seo

source: Skoool.ie is an online educational resource for secondary students
ga: Acmhainn oideachasúil ar líne le haghaidh daltaí meánscoile is ea Skoool.ie

source: The site provides online, interactive, multimedia lessons, study notes for a wide range of subjects on the Junior and Leaving Certificate curricula, study and revision tips and advice for students and teachers
ga: Tá ceachtanna idirghníomhacha ilmheán le fáil ar an láithreán mar aon le nótaí staidéir faoi réimse leathan ábhar ar na curaclaim don Teastas Sóisearach agus don Ardteist agus iad ann le haghaidh daltaí agus múinteoirí araon

source: Skoool.ie also gives guidance about transition year projects and preparing for the job market
ga: Tá comhairle le fáil i Skoool.ie faoin thionscadail a bheadh oiriúnach don Idirbhliain agus faoi ullmhú don mhargadh saothair

source: Gaelscoileanna is the main co-ordinating body for Irish-speaking schools, both primary and post-primary
ga: Is í Gaelscoileanna an príomheagraíocht comhordaithe le haghaidh scoileanna lán-Ghaeilge, idir bhunscoileanna agus iarbhunscoileanna

source: It aims to advance the use of Irish as the language of instruction in schools around the country
ga: Is í an aidhm atá aici ná an Ghaeilge a chur chun cinn mar theanga teagaisc ar fud na tíre

source: Support is provided to parents who want their children educated through Irish, and to local committees who want to establish all-Irish schools in their own locality
ga: Tacaíonn siad le tuismitheoirí ar mhian leo go dtabharfaí oideachas trí mheán na Gaeilge dá leanaí agus le coistí áitiúla ar mhian leo scoileanna lán-Ghaeilge a bhunú ina gceantair féin

source: National Parents Council (Post Primary)
ga: An Chomhairle Náisiúnta Tuismitheoirí (Iar-bhunoideachais)

source: The National Parents Council - Post Primary (NPCpp) is a nationwide organisation that represents the interests of parents with children in second-level education
ga: Eagraíocht í An Chomhairle Náisiúnta Tuismitheoirí - Iarbhunoideachais (NPCpp) atá bunaithe ar fud na tíre agus a dhéanann ionadaíocht ar thuismitheoirí a bhfuil a leanaí ag fáil oideachais dara leibhéil

source: It tries to actively involve parents in all aspects of their children’s education, to provide a voice for parents in the development of parent groups and to monitor educational development and educational opportunities
ga: Déanann sí iarracht a chinntiú go bhfuil baint ag tuismitheoirí le gach gné d’oideachas a leanaí agus go dtugtar deis labhartha do na tuismitheoirí nuair atá grúpaí tuismitheoirí á bhforbairt, agus déanann siad monatóireacht ar fhorbairtí agus ar dheiseanna oideachais

source: Irish Second-Level Students Union
ga: Aontas na Mac Léinn Dara-Leibhéil

source: The Irish Second-Level Students Union (ISSU) is the national umbrella body for school student councils
ga: Is é Aontas na Mac Léinn Dara-Leibhéil (ISSU) an bhrateagraíocht do chomhairlí mac léinn i scoileanna dara-leibhéil

source: It aims to represent and connect second-level students throughout Ireland, to ensure that the voice of the Irish second-level student is heard and to strive for innovation and democracy within the education system
ga: Tá siad mar aidhmeanna aige ionadaíocht a dhéanamh ar son mic léinn dara-leibhéil agus iad a nascadh le chéile; cinntiú go gcloisfear guth na mac léinn dara-leibhéil; agus dréim le nuálaíocht agus daonlathas sa chóras oideachais

source: ISSU aims to provide training, guidance and advice to empower students and equip them to become actively involved in the decision-making processes in their own school communities
ga: Oibríonn ISSU chun oiliúint, treoir agus comhairle a chur ar fáil do dhaltaí le cur ar a gcumas páirt a ghlacadh sna próisis chinnteoireachta ina gcuid scoileanna féin

source: It also aims to work in partnership with other organisations to bring the views of second-level school students in relation to educational issues to the attention of policy-makers and the media
ga: Tá sí d’aidhm aige freisin obair i gcomhpháirtíocht le heagraíochtaí eile chun dearcadh na mac léinn dara-leibhéil faoi cheisteanna oideachais a chur in iúl do lucht ceaptha beartas agus do na meáin chumarsáide

source: If you choose to educate your child at home, the Home Education Network may be a good source of information for you
ga: Má roghnaíonn tú oideachas a chur ar do leanbh sa bhaile, d’fhéadfá mórchuid eolais a fháil ó An Líonra um Oideachas sa Bhaile

source: It is a support and lobby group for home educators in Ireland
ga: Grúpa tacaíochta agus stocaireachta lucht oideachais sa bhaile in Éirinn is ea é

source: It aims to help parents use the available resources to develop educational techniques suitable for each child’s needs
ga: Cuireann siad rompu cabhrú le tuismitheoirí na hacmhainní atá ar fáil a úsáid agus modhanna oideachais a fhorbairt a fheilfidh do riachtanais gach linbh

source: It also provides a means for the exchange of ideas and experience among home educators through regular meetings and newsletters
ga: Cabhraíonn sé le lucht oideachais sa bhaile a gcuid tuairimí agus an taithí atá acu a mhalartú lena chéile trí chruinnithe rialta a bheith acu agus trí nuachtlitreacha

source: Its website contains links to research and online information about home education and it also operates a library service of books on home education that is available to members
ga: Tá naisc le taighde agus le faisnéis ar líne faoi oideachas sa bhaile le fáil ar a láithreán gréasáin agus is féidir leis na baill leabhair faoin ábhar seo a fháil ó sheirbhís leabharlainne an ghrúpa

source: The Teachers Union of Ireland (TUI) represents teachers and lecturers in vocational schools, community colleges, community and comprehensive schools, institutes of technology, further education and other specialist areas
ga: Déanann Aontas Múinteoirí Éireann (TUI) ionadaíocht thar cheann múinteoirí agus léachtóirí i scoileanna gairmoideachais, i gcoláistí pobail, i bpobalscoileanna agus i scoileanna cuimsitheacha, in institiúidí teicneolaíochta, i gcoláistí breisoideachais agus i réimsí speisialtóireachta eile

source: The TUI has produced a number of policy documents on issues such as bullying and sexual harassment in schools
ga: Tá roinnt cáipéisí beartais curtha ar fáil ag an TUI faoi cheisteanna mar bhulaíocht agus ciapadh gnéasach i scoileanna

source: They also provide details of conditions of service and contracts for their members, including the full text of the conciliation and arbitration scheme for teachers
ga: Cuireann siad sonraí faoi choinníollacha seirbhíse agus conarthaí ar fáil dá mbaill, lena n-áirítear téacs iomlán na scéime eadrána agus idir-réitigh le haghaidh múinteoirí

source: Association of Secondary Teachers of Ireland
ga: Cumann na Meánmhúinteoirí, Éire

source: The Association of Secondary Teachers of Ireland (ASTI) is the main second-level teachers’ union in Ireland
ga: Is é Cumann na Meánmhúinteoirí, Éire (ASTI) príomh-cheardchumann múinteoirí dara leibhéil na hÉireann

source: ASTI members teach in voluntary secondary schools, community and comprehensive schools and colleges
ga: Tá baill an chumainn ag múineadh i meánscoileanna deonacha agus i scoileanna agus i gcoláistí cuimsitheacha agus pobail

source: ASTI is a source of information on pay and conditions for teachers and provides its members with a professional advocacy service
ga: Cuireann an ASTI eolas ar fáil faoi phá agus faoi choinníollacha oibre do mhúinteoirí agus cuireann sé seirbhís ghairmiúil thacaíochta ar fáil dá bhaill

source: It also runs a professional development service for teachers
ga: Lena chois sin cuireann sé seirbhís fhorbartha ghairme ar fáil le haghaidh múinteoirí

source: ASTI has produced a number of information leaflets for teachers covering issues such as discipline in schools, bullying and guidelines for professional behaviour
ga: Tá roinnt bileoga faisnéise curtha ar fáil ag an ASTI do mhúinteoirí faoi cheisteanna mar smacht sna scoileanna, bulaíocht agus treoirlínte maidir le hiompar gairmiúil

source: Education and Training Boards Ireland (ETBI)
ga: Boird Oideachais agus Oiliúna Éireann

source: The Education and Training Boards Ireland (ETBI) (formerly called Irish Vocational Education Association) represents the interests of the 16 Education and Training Boards (formerly called Vocational Education Committees)
ga: Déanann Boird Oideachais agus Oiliúna Éireann (BOOE) (tugadh an Cumann Gairmoideachais in Éirinn air roimhe sin) ionadaíocht ar mhaithe le leas 16 Bord Oideachais agus Oiliúna (tugadh Coistí Gairmoideachais orthu roimhe)

source: It aims to promote and enhance the interests of vocational education and training
ga: Tá sé d'aidhm aige gairmoideachas agus gairmoiliúint a chur chun cinn agus a fheabhsú

source: The ETBI offers training and continued professional development to its members, contributes to national policy discussion and has produced a number of booklets on issues such as managing allegations of child sexual abuse and policies on educational provision for asylum seekers and refugees
ga: Cuireann BOOE oiliúint agus forbairt leanúnach gairme ar fáil dá bhaill, cuireann siad le díospóireacht faoi bheartais náisiúnta agus chuir siad roinnt leabhrán ar fáil faoi cheisteanna mar déileáil le líomhaintí faoi mhí-úsáid ghnéasach páistí agus faoi oideachas a chur ar fáil le haghaidh dídeanaithe agus lucht iarrtha tearmainn

source: National Association of Principals and Deputy Principals
ga: Cumann Náisiúnta Príomhoidí agus Leas-phríomhoidí

source: The National Association of Principals and Deputy Principals (NAPD) represents principals and deputy principals at post-primary level
ga: Déanann an An Náisiúnta Príomhoidí agus Leas-phríomhoidí ionadaíocht thar cheann príomhoidí agus leas-phríomhoidí in iar-bhunscoileanna

source: The organisation has a network of nine regional branches and a range of sub-committees working on specific areas of education
ga: Tá líonra de naoi mbrainse réigiúnacha san eagraíocht agus tá réimse fochoistí acu ag obair ar réimsí oideachais faoi leith

source: It ensures that members are represented on all relevant national and international bodies and that principals and deputy principals are consulted on education policy initiatives that may affect their role
ga: Déanann siad deimhin de go mbíonn ionadaíocht ag a mbaill ar gach eagraíocht ábhartha náisiúnta agus idirnáisiúnta, agus go dtéitear i gcomhairle le príomhoidí agus le leas-phríomhoidí faoi thionscnaimh oideachais a bhféadfadh tionchar a bheith acu ar na róil atá acu

source: The NAPD also provides support and advice for principals and deputy principals through a secretariat
ga: Lena chois sin tá rúnaíocht ag an gcumann a chuireann comhairle ar fáil do phríomhoidí agus do leas-phríomhoidí

source: The Teaching Council promotes and develops teaching as a profession at primary and post-primary levels
ga: Cuireann an Chomhairle Mhúinteoireachta an mhúinteoireacht chun cinn agus forbraíonn í mar ghairm ar leibhéil bhunoideachais agus iar-bhunoideachais

source: It provides a forum for presenting the views of the profession on all aspects of the teaching career from initial recruitment to in-career professional development
ga: Cuireann sí fóram ar fáil chun dearcadh lucht na gairme a chur ar fáil faoi gach gné de shaol múinteoirí ón gcéad lá a earcaítear iad go forbairt gairme le linn gníomhréime

source: The Council maintains a register of all teachers who teach in recognised schools
ga: Tá clár ag an gComhairle de na múinteoirí go léir a mhúineann i scoileanna aitheanta in Éirinn

source: As the regulatory body for teachers in Ireland, the Teaching Council produces a code of professional conduct for teachers, which covers standards of teaching, knowledge, skill and competence
ga: Is comhlacht rialála í an Chomhairle Teagaisc le haghaidh múinteoirí in Éirinn agus cuireann sí cód iompair ghairmiúil ar fáil do mhúinteoirí. Baineann sé seo le caighdeáin múinteoireachta, eolas, scileanna agus inniúlacht

source: Foras na Gaeilge is the body responsible for promoting the Irish language
ga: Is é Foras na Gaeilge an eagraíocht atá freagrach as an Ghaeilge a chur chun cinn

source: Its website covers a number of topics including the roots of the Irish language and some background on the Gaeltacht areas
ga: Tá roinnt ábhar ar a láithreán gréasáin a bhaineann le rudaí mar fréamhacha na Gaeilge agus roinnt eolais cúlra faoi ceantair Ghaeltachta

source: The site has a comprehensive list of Irish courses available to both children and adults and covers how Irish is taught in schools
ga: Tá liosta cuimsitheach ar an láithreán gréasáin de na cúrsaí Gaeilge atá ar fáil le haghaidh leanaí agus daoine fásta mar aon le cuntas ar an gcaoi a mhúintear Gaeilge sna scoileanna

source: Foras na Gaeilge provides teaching resources to Irish teachers who want to update their skills and offers advise to parents who want to help improve their child’s Irish
ga: Cuireann Foras na Gaeilge acmhainní múinteoireachta ar fáil le haghaidh múinteoirí Gaeilge ar mhian leo a scileanna a fheabhsú agus tugann comhairle do thuismitheoirí ar mhian leo feabhas a chur ar Ghaeilge a leanaí

source: The website gives details of social outlets where Irish is spoken and provides a list of Irish language organisations and groups
ga: Tá sonraí ar an láithreán gréasáin faoi na hionaid shóisialta ina labhraítear Gaeilge mar aon le liosta de na heagraíochtaí agus de na grúpaí Gaeilge

source: English as a second language
ga: An Béarla mar dara teanga

source: A number of schools have been set up in Ireland to offer tuition in English as a second language
ga: Tá go leor scoileanna ar fud na hÉireann le haghaidh daoine a mbíonn suim acu Béarla a fhoghlaim mar dara teanga

source: The BBC Learning site has information for students at school, college and on adult education courses
ga: Tá faisnéis ar an láithreán gréasáin BBC Learning le haghaidh mic léinn atá ar scoil, i gcoláistí nó ag glacadh páirte i gcúrsaí oideachais do dhaoine fásta

source: It operates a number of online courses in areas such as science, languages and information technology and recommends external sites for particular areas of study
ga: Reáchtálann sé roinnt cúrsaí ar líne i réimsí mar eolaíocht, teangacha agus teicneolaíocht faisnéise agus molann láithreáin sheachtracha chun staidéar a dhéanamh ar réimsí áirithe iontu

source: The Learning Alive site is designed specially for students and their teachers
ga: Dearadh an láithreán gréasáin Foghlaim Beo go sonrach le haghaidh daltaí agus a múinteoirí

source: It has an interactive learning section devoted to secondary students and the staffroom area provides information and support for teachers and other education professionals
ga: Tá cuid ann le haghaidh daltaí meánscoileanna inar féidir leo foghlaim go hidirghníomhach, agus tá faisnéis agus tacaíocht le haghaidh múinteoirí agus gairmithe oideachais eile le fáil sa chuid seomra foirne
